# Become an SQL Rock Star! :)
### By Michael

Step 1: If you didn't already, download sample sqlite database from: http://www.sqlitetutorial.net/sqlite-sample-database

Step 2: Use sqlite3 package to make a connection to sqlite database from the downloaded file.

Step 3: Answer the questions below by writing appropriate SQL queries.

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
db = 'chinook.db'

### List all tables in db

In [6]:
con = sql.connect(db)

def sql_fetch(con): 
    cursorObj = con.cursor()
 
    cursorObj.execute('SELECT name FROM sqlite_master WHERE type= "table"')
 
    print(cursorObj.fetchall())
 
sql_fetch(conn)

[('albums',), ('sqlite_sequence',), ('artists',), ('customers',), ('employees',), ('genres',), ('invoices',), ('invoice_items',), ('media_types',), ('playlists',), ('playlist_track',), ('tracks',), ('sqlite_stat1',)]

1. How many customers are there that are not residing in the US?

In [ ]:
customers = pd.read_sql_query(sql='SELECT * FROM customers', con=con)
customers.head()

In [20]:
cx_outside_US = """SELECT COUNT(*) 
                    FROM customers 
                    WHERE Country != 'US';"""

In [38]:
pd.read_sql_query(sql=cx_outside_US, con=con)

   COUNT(*)
0        59

2. Show all customers that are from Brazil. How many Brazilian customers are there?

In [29]:
cx_in_BRA = """SELECT * 
                FROM customers 
                WHERE Country == 'Brazil';"""

In [61]:
brazil = pd.read_sql_query(sql=cx_in_BRA, con=con)
print(f'there are {brazil.shape[0]} Brazilian customers')
brazil

there are 5 Brazilian customers

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

</br>

3. Show Invoices of customers who are from the US. The resultant table should show the customer's full name, Invoice ID, Date of the invoice and billing country.

In [65]:
invoices = pd.read_sql_query(sql='SELECT * FROM invoices', con=con)
invoices.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [57]:
inv_cx_US = """SELECT customers.CustomerId, customers.FirstName, customers.LastName, invoices.InvoiceId, invoices.InvoiceDate, invoices.BillingCountry
                FROM invoices
                JOIN customers
                ON customers.CustomerId = invoices.CustomerId
                WHERE BillingCountry = 'USA';"""

In [60]:
pd.read_sql_query(sql=inv_cx_US, con=con)

,CustomerId,FirstName,LastName,InvoiceId,InvoiceDate,BillingCountry
0,23,John,Gordon,5,2009-01-11 00:00:00,USA
1,16,Frank,Harris,13,2009-02-19 00:00:00,USA
2,17,Jack,Smith,14,2009-03-04 00:00:00,USA
3,19,Tim,Goyer,15,2009-03-04 00:00:00,USA
4,21,Kathy,Chase,16,2009-03-05 00:00:00,USA
...,...,...,...,...,...,...
86,27,Patrick,Gray,397,2013-10-13 00:00:00,USA
87,20,Dan,Miller,405,2013-11-21 00:00:00,USA
88,21,Kathy,Chase,406,2013-12-04 00:00:00,USA
89,23,John,Gordon,407,2013-12-04 00:00:00,USA
90,25,Victor,Stevens,408,2013-12-05 00:00:00,USA

</br>

In [49]:
employees = pd.read_sql_query(sql='SELECT * FROM employees', con=con)
employees.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

4. How many Employees are working as Sales Agents?

In [62]:
sales_agents = """SELECT COUNT(*) 
                    FROM employees 
                    WHERE Title = 'Sales Support Agent';"""

In [63]:
pd.read_sql_query(sql=sales_agents, con=con)

   COUNT(*)
0         3

5. To which countries the invoices were sent? Show the list of all countries.

In [64]:
invoice_items = pd.read_sql_query(sql='SELECT * FROM invoice_items', con=con)
invoice_items.head()

   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1
1              2          1        4       0.99         1
2              3          2        6       0.99         1
3              4          2        8       0.99         1
4              5          2       10       0.99         1

In [76]:
countries_invoiced = """SELECT DISTINCT invoices.BillingCountry
                        FROM invoices
                        JOIN invoice_items
                        ON invoices.InvoiceId = invoice_items.InvoiceId;"""

In [77]:
pd.read_sql_query(sql=countries_invoiced, con=con)

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

6. How many Invoices were there in 2010 and 2011? What are the respective total sales for each of those years?

In [101]:
inv_2010_2011 = """SELECT InvoiceDate, Total
                        FROM invoices
                        WHERE (SELECT YEAR(InvoiceDate) >=2010 );"""

In [102]:
pd.read_sql_query(sql=inv_2010_2011, con=con)

DatabaseError: Execution failed on sql 'SELECT InvoiceDate, Total
                        FROM invoices
                        WHERE (SELECT YEAR(InvoiceDate) >=2010 );': no such function: YEAR

7. How many Invoices were created for each country?

8. How many tracks are there in each playlist?

9. How much in total did every Sales Agent make?

10. What is the sales agent that made the most sales in 2012?

11. Which sales agent made the most in sales overall?

12. What is the number of customers assigned to each sales agent?

13. Which country's customers spent the most?

14. Show the most purchased track of 2010.

15. Show the top 5 most purchased tracks ever.

16. What are the top 3 best selling artists?

17. What is the most purchased Media Type?

18. Show the number of tracks purchased in all invoices that contain more than one genre.

In [ ]:
#Close the connection
conn.close()